In [1]:
# Range, Expression
import pandas as pd
import numpy as np

In [2]:
range_without_start = range(10)
print(range_without_start)

range(0, 10)

In [3]:
range_without_start = range(10)
print(list(range_without_start))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [4]:
range_with_start_0 = range(0, 10)
print(list(range_with_start_0))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [5]:
for num in range(1, 11):
    if num % 2 == 0:
        print(num * 10, end = " ")

20 40 60 80 100

In [6]:
[num * 10 if num % 2 == 0 else "None" for num in list(range(1, 11))]

['None', 20, 'None', 40, 'None', 60, 'None', 80, 'None', 100]

In [7]:
math_expression = lambda x: ((153 - x ** 3) ** 4) / ((1 + x) ** 5)
result = math_expression(3)
print(result)

246140.015625

In [8]:
employee_names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
type(employee_names)

list

In [9]:
if isinstance(employee_names, list):
    print("employee_names is a list.")
else:
    print("employee_names is not a list.")

employee_names is a list.

In [10]:
employee_names_Series = pd.Series(employee_names)

In [11]:
employee_names_Series

0             Amy White
1          Jack Stewart
2    Richard Lauderdale
3          Sara Johnson
dtype: object

In [12]:
type(employee_names_Series)

pandas.core.series.Series

In [13]:
work_experience_years = pd.Series([5,8,3,10])
work_experience_years

0     5
1     8
2     3
3    10
dtype: int64

In [14]:
import numpy as np
array_age = np.array([50, 53, 35, 43])
array_age

array([50, 53, 35, 43])

In [15]:
type(array_age)

numpy.ndarray

In [16]:
array_c = np.array([[1000, 50, 78.45], [700, 112, 35.5]])
array_c

array([[1000.  ,   50.  ,   78.45],
       [ 700.  ,  112.  ,   35.5 ]])

In [17]:
['No. of Employees', 'Avg. Annual Revenue ($)', 'Share price ($)']

['No. of Employees', 'Avg. Annual Revenue ($)', 'Share price ($)']

In [18]:
['Company A', 'Company B']

['Company A', 'Company B']

In [19]:
company_statistics = pd.DataFrame(array_c, columns = ['No. of Employees', 'Avg. Annual Revenue ($)', 'Share price ($)'], index = ['Company A', 'Company B'])

In [20]:
company_statistics

           No. of Employees  Avg. Annual Revenue ($)  Share price ($)
Company A            1000.0                     50.0            78.45
Company B             700.0                    112.0            35.50

In [21]:
array_a = np.array([['Amy White',50,5],['Jack Stewart',53,8], ['Richard Lauder',35,3],['Sara Johnson',43,10]])
array_a

array([['Amy White', '50', '5'],
       ['Jack Stewart', '53', '8'],
       ['Richard Lauder', '35', '3'],
       ['Sara Johnson', '43', '10']], dtype='<U14')

In [22]:
df = pd.DataFrame(array_a, columns = ['Name', 'Age', 'Work Experience(Yrs)'])

In [23]:
df

             Name Age Work Experience(Yrs)
0       Amy White  50                    5
1    Jack Stewart  53                    8
2  Richard Lauder  35                    3
3    Sara Johnson  43                   10

In [24]:
print(df)

             Name Age Work Experience(Yrs)
0       Amy White  50                    5
1    Jack Stewart  53                    8
2  Richard Lauder  35                    3
3    Sara Johnson  43                   10

In [25]:
names = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'])
age = pd.Series([50, 53, 35, 43])
working_experience_yrs = pd.Series([5, 8, 3, 10])
data = {
    'Name': names,
    'Age': age,
    'Work Experience(Yrs.)': working_experience_yrs}

In [26]:
df = pd.DataFrame(data)
print(df)

                 Name  Age  Work Experience(Yrs.)
0           Amy White   50                      5
1        Jack Stewart   53                      8
2  Richard Lauderdale   35                      3
3        Sara Johnson   43                     10

In [27]:
x = 200

if x > 200: 
    print ("Big")
elif x > 100 and x <= 200:
    print ("Average")
elif x >=0 and x <=100:
    print ("Small")
else if x<0:
    print ("Negative")

SyntaxError: expected ':' (3824403843.py, line 9)

In [ ]:
x = 200

if x > 200:
    print("Big")
elif 100 < x <= 200:
    print("Average")
elif 0 <= x <= 100:
    print("Small")
elif x < 0:
    print("Negative")

In [ ]:
df_concatenated.columns.values
column_names = ['Reason for Absence', 'Date', 'Transportation Expense',
       'Distance to Work', 'Daily Work Load Average', 'Body Mass Index',
       'Education', 'Children', 'Pets', 27,
       28, 29, 30, 31, 32, 33, 34, 36, 37, 38, 39, 40, 41, 43, 46, 47, 48,
       49, 50, 58, 'Absenteeism Time in Hours']
df_concatenated = df_concatenated[column_names]
df_concatenated